// Напишите программу, которая будет выдавать
// название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница

Console.WriteLine("Введи число");
number = Convert.ToInt32(Console.ReadLine());

if (number == "1");
{
    Consol.WriteLine ($"{nuber} = понедельник);

}
else if
{
    (number == "2");
    Consol.WriteLine ($"{nuber} = понедельник);
}    
else if
{
    (number == "3");
    Consol.WriteLine ($"{nuber} = вторник);
}    
else if
{
    (number == "3");
    Consol.WriteLine ($"{nuber} = среда);
}    
else if
{
    (number == "4");
    Consol.WriteLine ($"{nuber} = понедельник);
}    
